# Вычислить число c заданной точностью d
# Пример:
# - при $d = 0.001, π = 3.141.$    $10^{-1} ≤ d ≤10^{-10}$

pi = 3
i = 1
sgn = 1
while str(pi)[:12] != '3.1415926535' :
    pi +=sgn/(i*(i+1)*(2*i+1))
    sgn *= -1
    i += 1

pi_str = str(pi)

number =  int(input("Введите число для заданной точности числа Пи:"))
print(pi)
print(f"0.{'0'*(number-1)}{pi_str[number+1]}")
